# Лабораторная работа 2: GARCH(p, q)
# 1. Построить график стационарного процесса {ℎ𝑛} и график волатильности 
# {𝜎𝑛} процесса GARCH(1,0), из 𝑛 = 1000 наблюдений.

n = 1000
a0 = 0.7
a1 = 0.2

GARCH = function(a0, a1, n) # функция процесса GARCH(1, 0)
{
  eps = rnorm(n, 0, 1) # Случайные ошибки
  sigma = numeric(n) # Волатильность
  h = numeric(n)
  # Начальные значения
  sigma[1] = 1
  h[1] = 0
  
  # Генерация процесса
  for (i in 2:n) {
    sigma[i] = a0 + a1*(h[i-1])^2
    h[i] = sqrt(sigma[i])*eps[i]
  }
  
  # Построение графиков
  plot(h, type = "l", main = "График стационарного процесса GARCH(1,0)",
       xlab = "Наблюдения", ylab = "h", col = "blue", lwd = 2)
  plot(sigma, type = "l", main = "График волатильности процесса GARCH(1,0)",
       xlab = "Наблюдения", ylab = "σ", col = "red", lwd = 2)
  h
}

h = GARCH(a0,a1,n)

# 2. Оценить параметры a0 и a1 с помощью метода наименьших квадратов (МНК), путем  
# преобразования процесса ARCH(1) ≡ GARCH(1,0) к процессу авторегрессии первого порядка. ???

MNK_a1 = function(h) # Функция для МНК оценки параметра a1
{
  a = b = c = d = 0
  for (i in 2 : n) 
  { # Нахождение компонентов формулы
    a = a + h[i-1]^2
    b = b + h[i]^2
    c = c + h[i-1]^4
    d = d + h[i-1]^2 * h[i]^2
  }
  num = (d/n) - (a*b/(n^2))
  denum = (c/n) - (a/n)^2
  return (num/denum) # формула для оценки а1
}

mnk_est_a1 = MNK_a1(h)
mnk_est_a1

MNK_a0 = function(h, a)  # Функция для МНК оценки параметра a0
{
  x = y = 0
  for (i in 2 : n) 
  { # Нахождение компонентов формулы
    x = x + h[i-1]^2
    y = y + h[i]^2
  }
  return ((y/n) - (a*x/n)) # формула для оценки а0
}

mnk_est_a0 = MNK_a0(h, mnk_est_a1) # в расчет МНК оценки для а0 передаем мнк оценку а1
mnk_est_a0

# 3. Оценить параметры a0, a1 при помощи функции garch() пакета tseries по выборке {ℎ𝑛}.
install.packages("tseries")
library("tseries")

garch(h, order = c(0, 1), start = c(a0, a1))

# 4. Построить график стационарного процесса GARCH(3,0), из 𝑛 = 1100 наблюдений. 
# Разделить процесс на обучающую и тестовую выборки в отношении 10:1. 
# Оценить вектор параметров (𝑎0, 𝑎1, 𝑎2, 𝑎3)′ на обучающей выборке, используя 
# функцию garch(). Затем вычислить последовательность прогнозов на 1 шаг {ℎ𝑛+1|𝑛} 
# на тестовой выборке и наложить прогнозы на график процесса.

n = 1100
a = c(0.2, 0.1, 0.4, 0.3) # Вектор параметров а

GARCH_30 = function(n,a)
{
  eps = rnorm(n, 0, 1) # Случайные ошибки
  sigma = numeric(n) # Волатильность
  h = numeric(n) # Генерируемый процесс
  
  # Начальные значения
  h[1] = 0
  sigma[2] = a[1]
  h[2] = sqrt(sigma[2]) * eps[1]
  sigma[3] = a[1] + a[2] * (h[2]^2) + a[3] * (h[1]^2)
  h[3] = sqrt(sigma[3]) * eps[2]
  
  # Основной цикл для всех оставшихся значений
  for (i in 4:n) {
    sigma[i] = a[1] + a[2] * (h[i - 1]^2) + a[3] * (h[i - 2]^2) + a[4] * (h[i - 3]^2)
    h[i] = sqrt(sigma[i]) * eps[i - 1]
  }
  return(h) 
}

h1 = GARCH_30(n,a)
plot(h1, type = 'l', main = "График стационарного процесса GARCH(3,0)")

# Разделение процесса на обучающую и тестовую выборки в отношении 10:1.
n = 1100
n1 = 1000 # 1000 к 100

h_train = h1[1 : n1] # Обучающая выборка (1:1000)
h_test = h1[(n1+1) : n] # Тестовая выборка (1001:1100)

g = garch(h_train, order = c(0, 3), start = a); g # Оценка вектора параметров а на обучающей выборке
aa = g$coef 

# Вычисление последовательности прогнозов на 1 шаг {ℎ𝑛+1|𝑛} на тестовой выборке
prediction = function(h_test, h_train, a) 
{
  h = numeric(100) # вектор со значениями на основе тестовой выборки
  hh = numeric(1100) # вектор-результат
  
  # Начальные значения
  h[1] = a[1]
  h[2] = a[1] + a[2]*(h_test[1]^2)
  h[3] = a[1] + a[2]*(h_test[2]^2) + a[3]*(h_test[1]^2)
  
  #Основной цикл
  for(i in 4 : 100) 
  {
    h[i] = a[1] + a[2]*(h_test[i-1]^2) + a[3]*(h_test[i-2]^2) + a[4]*(h_test[i-3]^2)
  }
  
  for(i in 1 : 1000) # Заполнение от 1 до 1000 значениями из обучающей выборки
  {
    hh[i] = h_train[i] 
  }
  for(i in 1001 : 1100)
  {
    hh[i] = h[i - 1000] # Добавление прогнозируемых значений
  }
  hh
}

h2 = prediction(h_test, h_train, aa)
lines(h2, type = 'l', col = "lightseagreen") # Наложение прогнозов на график процесса 

# 5. Построить стационарный процесс GARCH(1,1), из 𝑛 = 1000 наблюдений и 
# оценить его параметры (a0,a1,b1)′ по выборке {ℎ𝑛}, используя функцию garch().

n = 1000
# Параметры
a0 = 0.2 
a1 = 0.1
b1 = 0.6

GARCH_11 = function(n, a0, a1, b1) 
{
  h = numeric(n)
  sigma = numeric(n)
  eps = rnorm(n, 0, 1)
  
  # Начальные значения
  h[1] = 1
  sigma[1] = 1  # Стационарное начальное значение
  
  # Основной цикл
  for (i in 2 : n) 
  {
    sigma[i] = a0 + a1*(h[i-1])^2 + b1*sigma[i-1]
    h[i] = sqrt(sigma[i])*eps[i]
  }
  return(h)
}

h3 = GARCH_11(n, a0, a1, b1)
garch(h3, order = c(1, 1), start = c(a0, a1, b1)) # оценка параметров процесса GARCH(1,1)

