# Лабораторная работа 6: Оценивание параметров геометрического броуновского движения

# 1. Замоделировать процесс (10) для S0 = 100, a = 0.5, 𝜎 = 0.8, √∆ = 0.01, k = 0,1,...,10^3. ----
S_0 = S = 100
a = 0.5
sigma = 0.8
delta = 0.0001
n = 1000
e = rnorm(n, 0, sqrt(delta)) 
B = 0
for(k in 1 : n)
{
  B[k + 1] = B[k] + e[k]  
  # моделирование процесса при заданных параметрах
  S[k + 1] = S_0*exp((a - ((sigma^2)/2))*(k + 1)*delta + sigma*B[k + 1]) 
}
plot(seq(0, delta*1000, delta), S, type = 'l', main = "Реализация геометрического броуновского движения")

# 2. Рассчитать оценки параметров броуновского движения по наблюдениям процесса {𝑆𝑘∆}𝑘≥1 ----
X = 0
for(k in 2 : 1000)
  X[k - 1] = log(S[k]) - log(S[k - 1])

# Оценки волатильности и сноса: 
Sum = var(X)
sigma_1 = Sum/delta; sigma_1 # 𝜎^2 = 0.64
μ = (1/n)*sum(X)
a_1 = μ/delta + sigma_1/2; a_1 # a = 0.5
